In [1]:
import numpy as np
import pandas as pd

# DAY 14

In [2]:
one = [12,34,56,87]
two = [87,23,74,98]
three = [78,35,43,23]
np.concatenate([one,two,three])

array([12, 34, 56, 87, 87, 23, 74, 98, 78, 35, 43, 23])

In [3]:
first = [[3,4,6,8],[58,96,37,28]]
second = [[15,52,23,74],[25,56,37,58]]
np.concatenate([first, second], axis=0)

array([[ 3,  4,  6,  8],
       [58, 96, 37, 28],
       [15, 52, 23, 74],
       [25, 56, 37, 58]])

In [5]:
nom = pd.Series(['a','b','c','d'], index=[1,2,3,4])
tom = pd.Series(['e','f','g','i'], index=[5,6,7,8])
pd.concat([nom,tom])

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    i
dtype: object

In [8]:
datafm = pd.DataFrame([['Ola','Sade'],['Wale','Paul']], index=[1,2], columns=['One', 'Two'])
dat_fm = pd.DataFrame([['Ade','Bunmi'],['Mike','Mide']], index=[3,4], columns=['One', 'Two'])
pd.concat([datafm,dat_fm])

    One    Two
1   Ola   Sade
2  Wale   Paul
3   Ade  Bunmi
4  Mike   Mide

In [10]:
pd.concat([datafm,dat_fm], axis ="columns")

    One   Two   One    Two
1   Ola  Sade   NaN    NaN
2  Wale  Paul   NaN    NaN
3   NaN   NaN   Ade  Bunmi
4   NaN   NaN  Mike   Mide

In [11]:
pd.concat([datafm,dat_fm], axis =1)

    One   Two   One    Two
1   Ola  Sade   NaN    NaN
2  Wale  Paul   NaN    NaN
3   NaN   NaN   Ade  Bunmi
4   NaN   NaN  Mike   Mide

Working on how to combine an array, series and dataframe 
using concatenate method in numpy and using concat in pandas
both the series and dataframe

# DAY 16

In [3]:
na1 = pd.DataFrame({'Name':['Sunday', 'Joel', 'Johnson', 'Charse'], 
                    'position':['CEO', 'MD', 'Supervisor', 'Manager']})

na2 = pd.DataFrame({'Name':['Sunday', 'Joel', 'Johnson', 'Charse'], 
                    'position':['Supervisor', 'CEO', 'Manager', 'MD']})

In [4]:
pd.merge(na1, na2, on='Name')

      Name  position_x  position_y
0   Sunday         CEO  Supervisor
1     Joel          MD         CEO
2  Johnson  Supervisor     Manager
3   Charse     Manager          MD

In [5]:
pd.merge(na1, na2, on='Name', suffixes=['_Oyo', '_Ibadan'])

      Name position_Oyo position_Ibadan
0   Sunday          CEO      Supervisor
1     Joel           MD             CEO
2  Johnson   Supervisor         Manager
3   Charse      Manager              MD

In [8]:
pd.merge(na1, na2, on='Name',how="inner")

      Name  position_x  position_y
0   Sunday         CEO  Supervisor
1     Joel          MD         CEO
2  Johnson  Supervisor     Manager
3   Charse     Manager          MD

In [9]:
df6 = pd.DataFrame({'Name':['Peter', 'Paul', 'Mary'], 'Food':['Fish', 'Beans','Bread']}, 
                   columns=['Name', 'Food'])

df7 = pd.DataFrame({'Name':['Mary', 'Joseph'], 'Drink':['Wine', 'Beer']}, 
                   columns=['Name', 'Drink'])

In [10]:
pd.merge(df6, df7, how='inner')

   Name   Food Drink
0  Mary  Bread  Wine

# DAY 17

In [11]:
data_df = pd.DataFrame({"key":['A','B','C','A','B','C'], "data":range(6)})
data_df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [12]:
rng= np.random.RandomState(0)
df_gen = pd.DataFrame({"key":['A','B','C','A','B','C'], "data":range(6), 'data2':rng.randint(0,
                                                                                        10,6)})
df_gen

  key  data  data2
0   A     0      5
1   B     1      0
2   C     2      3
3   A     3      3
4   B     4      7
5   C     5      9

In [13]:
df_gen.groupby('key').aggregate(['min', np.median, max])

    data            data2
     min median max   min median max
key
A      0    1.5   3     3    4.0   5
B      1    2.5   4     0    3.5   7
C      2    3.5   5     3    6.0   9

In [14]:
df_gen.groupby('key').aggregate({'data':'min','data2':max})

     data  data2
key
A       0      5
B       1      7
C       2      9

In [12]:
def filter_func(x):
    return x['data2'].std()>4
print(df_gen.groupby('key').std());
df_gen.groupby('key').filter(filter_func)

NameError: name 'df_gen' is not defined

In [ ]:
By“groupby”wearereferringtoaprocessinvolvingoneormoreofthefollowingsteps: 
    • Splittingthedataintogroupsbasedonsomecriteria 
    • Applyingafunctiontoeachgroupindependently 
    • Combiningtheresultsintoadatastructure

# DAY 18

In [9]:
dfgb = pd.DataFrame( {"Color": "Red Red Red Blue".split(), "Value": [100, 150, 50, 50]}) 
dfgb

  Color  Value
0   Red    100
1   Red    150
2   Red     50
3  Blue     50

In [10]:
dfgb["Counts"] = dfgb.groupby(["Color"]).transform(len)
dfgb

  Color  Value  Counts
0   Red    100       3
1   Red    150       3
2   Red     50       3
3  Blue     50       1

In [11]:
df = pd.DataFrame({ "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"], 
                          "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
                          "C": np.random.randn(8),
                           "D": np.random.randn(8),})
df

     A      B         C         D
0  foo    one  0.243852 -0.690074
1  bar    one  1.233924  0.788165
2  foo    two -1.288149  0.582734
3  bar  three -1.529696 -1.161473
4  foo    two  0.205745 -0.352410
5  bar    two  0.359669 -1.652114
6  foo    one -0.947217 -0.288525
7  foo  three  0.326129  2.220051

In [14]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    1.233924  0.788165
    three -1.529696 -1.161473
    two    0.359669 -1.652114
foo one   -0.703364 -0.978599
    three  0.326129  2.220051
    two   -1.082404  0.230324

# DAY 19

In [15]:
rng = np.random.RandomState(42)
agser = pd.Series(rng.rand(5))
agser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [16]:
print('Sum = '+str(agser.sum()))
print('Minimum = ',agser.min())
print('Median = ',agser.median())
print('Maximum = ',agser.max())

Sum = 2.811925491708157
Minimum =  0.15601864044243652
Median =  0.5986584841970366
Maximum =  0.9507143064099162

In [17]:
print('Mean = ',agser.mean())
print('Standart Dev = ',agser.std())
print('Variance = ',agser.var())

Mean =  0.5623850983416314
Standart Dev =  0.30874824961862174
Variance =  0.09532548164256274

In [18]:
df = pd.DataFrame({'A': rng.rand(5),'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [20]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [25]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [26]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.325719  0.151056  2.064179  1.776385
2013-01-02  1.481930 -0.215408 -1.671050  0.166841
2013-01-03  0.139224 -0.523869 -0.112250 -1.896417
2013-01-04  1.264824  0.575749  0.370853 -0.595251
2013-01-05 -0.147684 -1.268656 -1.132193  1.341242
2013-01-06  0.925097 -2.659272  0.178422  2.355820

In [27]:
 s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [28]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

# DAY 20

In [30]:
import datetime
pandate = pd.to_datetime(["1/1/2018", np.datetime64("2018-01-01"), datetime.datetime(2018, 1, 1)] )

In [31]:
pandate

DatetimeIndex(['2018-01-01', '2018-01-01', '2018-01-01'], dtype='datetime64[ns]', freq=None)

In [33]:
date = pd.date_range("2018-01-01", periods=3, freq="H")
date

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00'],
              dtype='datetime64[ns]', freq='H')

In [34]:
alldate = date.tz_localize("UTC")

In [35]:
alldate

DatetimeIndex(['2018-01-01 00:00:00+00:00', '2018-01-01 01:00:00+00:00',
               '2018-01-01 02:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='H')

In [38]:
data = pd.date_range("2018-01-01", periods=5, freq="H")
u_ = pd.Series(range(len(data)), index=data)
u_

2018-01-01 00:00:00    0
2018-01-01 01:00:00    1
2018-01-01 02:00:00    2
2018-01-01 03:00:00    3
2018-01-01 04:00:00    4
Freq: H, dtype: int64

In [39]:
u_.resample("2H").mean()

2018-01-01 00:00:00    0.5
2018-01-01 02:00:00    2.5
2018-01-01 04:00:00    4.0
Freq: 2H, dtype: float64

In [41]:
today = pd.Timestamp("2022-02-15")
today.day_name()

'Tuesday'

In [42]:
tomm = today + pd.Timedelta("1 day")

In [43]:
tomm

Timestamp('2022-02-16 00:00:00')

In [44]:
tomm.day_name()

'Wednesday'